project-backend/app/controllers/attractions_controller.rb

SELECT "attractions".* FROM "attractions"
---
    def index
        attractions = Attraction.all

SELECT "attractions".* FROM "attractions" WHERE "attractions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        attraction = Attraction.find(params[:id])