project-backend/app/controllers/days_controller.rb

SELECT "days".* FROM "days"
---
    def index
        days = Day.all